Revit 2026 API

# TableSectionDataSetCellCombinedParameters(Int32, IListTableCellCombinedParameterData) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCellCombinedParameters(
	int nCol,
	IList<TableCellCombinedParameterData> paramData
)
```
```vb
Public Sub SetCellCombinedParameters (
	nCol As Integer,
	paramData As IList(Of TableCellCombinedParameterData)
)
```
```cpp
public:
void SetCellCombinedParameters(
	int nCol,
	IList<TableCellCombinedParameterData^>^ paramData
)
```
```fsharp
member SetCellCombinedParameters :
        nCol : int *
        paramData : IList<TableCellCombinedParameterData> -> unit
```

#### Parameters

nCol Int32

paramData IListTableCellCombinedParameterData

#### Reference

TableSectionData Class

SetCellCombinedParameters Overload

Autodesk.Revit.DB Namespace